w = 1.0;
a = -2;
b = -1.0;
A = [0, 1; w^2, 0];
B = [0; 1];
G = [a, b];
xmin = -1.2;
xmax = 1.2;
[t, y] = ode45(@(t, x)((A+B*G)*x), [0:0.1:10], [1/3, 1/3]);
plot(y(:,1), y(:,2))
hold on;
[t, y] = ode45(@(t, x)((A+B*G)*x), [0:0.1:10], [-1/3, -1/3]);
plot(y(:,1), y(:,2))
[t, y] = ode45(@(t, x)((A+B*G)*x), [0:-0.1:-1.7], [1/3, 1/3]);
plot(y(:,1), y(:,2))
[t, y] = ode45(@(t, x)((A+B*G)*x), [0:-0.1:-1.7], [-1/3, -1/3]);
plot(y(:,1), y(:,2));
%[t, y] = ode45(@(t, x)([;]), [0:-0.1:-1.7], [-1/3, -1/3]);
%plot(y(:,1), y(:,2));
f = @(t,d,e)[0.5*(1+d+e)*exp(t) + 0.5*(1+d-e)*exp(-t) - 1];
df = @(t,d,e)[0.5*(1+d+e)*exp(t) - 0.5*(1+d-e)*exp(-t)];
xx = -1:0.1:1;
plot([-1],[0], '*');
ff = f(xx, -1, 0.5);
ddff = df(xx, -1, 0.5);
plot(ff, ddff);

x = xmin:0.1:xmax;
y = 1 - 2.*x;
plot(x, y);
y = -1 - x;
plot(x, y);
%x = xmin:0.1:xmax;
y = -1 - 2.*x;
plot(x, y);

title('Фазовый портрет')
grid on
